# Rotation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleSheetInstance..::..Rotation Property
ScheduleSheetInstance Class See Also
---
Rotation of the ScheduleInstance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ViewportRotation Rotation { get; set; }
```

Visual Basic
---
```text
Public Property Rotation As ViewportRotation
	Get
	Set
```

Visual C++
---
```text
public:
property ViewportRotation Rotation {
	ViewportRotation get ();
	void set (ViewportRotation value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: This operation is prohibited for ScheduleInstances associated with revision schedules in titleblocks. -or- When setting this property: This operation is prohibited for ScheduleInstances that are pinned. |

# See Also
ScheduleSheetInstance Class
Autodesk.Revit.DB Namespace